import requests
import json
from pprint import pprint
import re


def append_to_text_file(value, filename='responses.txt'):
    # Открываем файл в режиме добавления. Если файл не существует, он будет создан.
    with open(filename, 'a', encoding='utf-8') as file:
        # Добавляем значение на новую строку в файл
        file.write(value + '\n')


def format_text(resp_text):
    # Регулярное выражение для поиска начала строки, начинающейся с пробелов и 1., 2., 3., 4., или 5.
    if re.match(r"^\s*[1-9]\.", resp_text):
        # Обрезаем начальные символы вида "1. " до первого пробела после точки
        resp_text = re.sub(r"^\s*[1-9]\.\s*", "", resp_text)
    # Проверка и удаление кавычек, если текст полностью заключен в один из видов кавычек
    # Обрабатываем одинарные (' '), двойные (" "), и угловые (« ») кавычки
    if re.match(r"^['\"]", resp_text) and re.search(r"['\"]$", resp_text):
        resp_text = resp_text[1:-1].strip()
    elif re.match(r"^«", resp_text) and re.search(r"»$", resp_text):
        resp_text = resp_text[1:-1].strip()
    return resp_text.strip()


def get_req(prompt):
    url = "https://api.deepseek.com/v1/chat/completions"

    payload = json.dumps({
        "messages": [
            {"content": "You are a helpful assistant.", "role": "system"},
            {"content": prompt, "role": "user"}
        ],
        "model": "deepseek-chat",
        "frequency_penalty": 0,
        "max_tokens": 2048,
        "presence_penalty": 0,
        "stop": None,
        "stream": False,
        "temperature": 1,
        "top_p": 1
    })

    headers = {
        'Content-Type': 'application/json',
        'Accept': 'application/json',
        'Authorization': 'Bearer sk-00555d8174554646a11276b58553a664'
    }

    resp = requests.post(url, headers=headers, data=payload)
    return resp


req = '''
Иногда женщины видят положительные моменты в этих эмоциях, прооралась, всем раздала, хорошенько разозлилась и переделала кучу дел. Это тот случай, когда психанула и отдраила всю квартиру 🙈 Спорю, что это знакомо каждой 😄

Но проблема в том, что внутренняя злость копится. Такой сильный источник энергии оказывает разрушающее влияние на саму женщину. С одной стороны, появляются силы свернуть горы, а с другой — накопившаяся злость и гнев ломают иммунную систему, а это уже запускает много разных механизмов, влияющих на здоровье женщины. 
Такой вот парадокс 🤷🏼‍♀️

Представьте воздушный шарик, который наполняется водой. Сначала он становится гладким, раскрывается. Но если продолжать его наполнять, он будет всё более тяжёлым и в какой-то момент просто лопнет. 

Потому очень важно научиться использовать свою энергию правильно 🙌🏼

Гнев — это хорошая эмоция, она позволяет многое создавать в этом мире. Главное, применять её так, чтобы она не действовала разрушающе на наш собственный организм. 

Нет плохих эмоций, нужно уметь правильно проживать не только радость, но и грусть, злость, ненависть. Они все составляющие нашей жизни и исключение каких-то «неправильных» чувств тоже не приведёт ни к чему хорошему.  

На вебинаре «Психология женской силы» 27 апреля мы затронем эту тему. Поговорим, как избежать разрушающего действия злости и гнева.

‼️Регистрация на вебинар по ссылке👇🏼
https://clck.ru/3ACDUR
'''
prompt = '''
Выбери наиболее подходящий по смыслу промт к сообщению выше из вариантов и напиши комментарий от лица реального человека не более одного предложения.
Не пиши в начале цифр или каких либо предисловий например ('1. Спасибо за советы, я пробую! '), только комментарий.  Варианты:
1. Дай доброжелательный осмысленный комментарий от первого лица. Размер комментария должен быть равен шести словам. Максимум одному предложению.
Веди себя реалистично и позитивно. Не делай оценочных суждений.
2. Напиши благодарность автору канала от первого лица. 
Размер комментария должен быть равен трем словам. Добавь смайлик в конце. Веди себя реалистично и позитивно. Не делай оценочных суждений.
3. Дай мудрый комментарий от первого лица. Размер комментария должен быть равен трём словам. Максимум одному предложению. Веди себя реалистично и позитивно.
4. Дай экспертный комментарий от первого лица. Размер комментария должен быть равен шести словам. Веди себя реалистично и позитивно. Не делай оценочных суждений. Веди себя как эксперт в области наставничества и предпринимательства.
'''
full_req = req + prompt
response = get_req(full_req)
data = response.json()
text = data["choices"][0]["message"]["content"]
print(text)
form_rext = format_text(text)
print('final')
print(form_rext)
append_to_text_file(text)