license_text = '''
<b>Пользовательское соглашение</b>

<b>1. Введение</b>
1.1. Наш сервис представляет собой автоматизированный софт, на платформе Telegram-бота, для массового комментинга телеграм каналов данного менеджера с использованием ChatGPT с целью привлечь внимание активных пользователей к своему рекламному аккаунту, на котором в описании профиля заранее заполнена информация о предоставляемой Вами услуге или Вашем продукте.
1.2. Используя наш сервис Вы автоматически соглашаетесь не использовать его в незаконных целях.

<b>2. Подписка на сервис и оплата</b>
2.1. Чтобы обеспечить удобство и безопасность приобретения подписки, мы принимаем платежи за подписку через сторонние платёжные системы.
2.2. Подписка представляет собой доступ к основному функционалу сервиса, который включает в себя следующие функции:
- Массовый коментинг телеграм каналов 
- Установка и настройка Telegram каналов для комментинга
- Установка триггеров ( ключевых слов в сообщении) к которым будут отправляться комментарии 
- Установка и настройка промтов ( запросов к нейросети) для каждого Telegram канала
- Заполнение рекламных аккаунтов, а именно: установка фото, имени, фамилии, юзернейма и информации
- Доступ к магазину, для покупки дополнительных рекламных аккаунтов.
2.3. При первом оформлении подписки, Вы получаете (?) аккаунтов для работы.
2.4. По истечении срока подписки, данный аккаунт закрепляется за Вами на 30 дней. Если в течение этого периода Вы не оформляете новую подписку, аккаунт будет изъят, и при следующем оформлении подписки Вам придется приобрести аккаунт отдельно. Однако данное действие не распространяется на дополнительные аккаунты - они будут доступны Вам на протяжении 180 дней. После истечения этого срока, если Вы не продлеваете свою подписку, соответствующий аккаунт автоматически деактивируется из-за отсутствия активности.
2.5. Мы оставляем за собой право на увеличение стоимости любого периода подписки. Это может быть обусловлено развитием системы, добавлением новых функций для улучшения сервиса, повышением курса доллара, а также затратами на поддержание инфраструктуры.

<b>3. Условия возврата и отмены платежа</b>
3.1. Если основной функционал нашего сервиса становится недоступным из-за технических проблем или изменений в Telegram, которые невозможно устранить, Вы в праве оформить возврат средств за неиспользованный период подписки и за активные дополнительные аккаунты.
3.2. Для начала процесса возврата необходимо связаться с нашей службой поддержки и предоставить реквизиты для получения средств.
3.3. Обратите внимание, что возврат осуществляется только на тот кошелек/карту, с которого производилась оплата.

<b>4. Гарантия на аккаунты</b>
4.1. Нельзя исключать вероятность того, что пользователи будут жаловаться на Ваши рекламные аккаунты, в следствие чего аккаунты могут быть заблокированы.
4.2. На каждый аккаунт действует гарантия 24 часа, если в гарантийный срок аккаунт блокируется, то он подлежит замене через обращение в техническую поддержку. В данном случае, срок подписки продлевается на период времени от момента обращения в техническую поддержку до выдачи нового аккаунта, но не менее чем на один час.

<b>Начав пользоваться нашим сервисом, Вы принимаете данное пользовательское соглашение.</b>
'''