import requests
import json
from pprint import pprint
import re
import aiohttp


async def append_to_text_file(value, filename='responses.txt'):
    # Открываем файл в режиме добавления. Если файл не существует, он будет создан.
    with open(filename, 'a', encoding='utf-8') as file:
        # Добавляем значение на новую строку в файл
        file.write(value + '\n')


async def format_text(resp_text):
    # Регулярное выражение для поиска начала строки, начинающейся с пробелов и 1., 2., 3., 4., или 5.
    if re.match(r"^\s*[1-9]\.", resp_text):
        # Обрезаем начальные символы вида "1. " до первого пробела после точки
        resp_text = re.sub(r"^\s*[1-9]\.\s*", "", resp_text)
    # Проверка и удаление кавычек, если текст полностью заключен в один из видов кавычек
    # Обрабатываем одинарные (' '), двойные (" "), и угловые (« ») кавычки
    if re.match(r"^['\"]", resp_text) and re.search(r"['\"]$", resp_text):
        resp_text = resp_text[1:-1].strip()
    elif re.match(r"^«", resp_text) and re.search(r"»$", resp_text):
        resp_text = resp_text[1:-1].strip()
    return resp_text.strip()


async def get_req(api_key, question):
    url = "https://api.deepseek.com/v1/chat/completions"

    prompt = '''
    Выбери наиболее подходящий по смыслу промт к сообщению выше из вариантов и напиши комментарий от лица реального человека мужского рода не более одного предложения.
    Не пиши в начале цифр или каких либо предисловий например ('1. Спасибо за советы, я пробую! '), только комментарий. Не используй смайлики. Варианты:
    1. Дай доброжелательный осмысленный комментарий от первого лица. Размер комментария должен быть равен шести словам. Максимум одному предложению.
    Веди себя реалистично и позитивно. Не делай оценочных суждений.
    2. Дай мудрый комментарий от первого лица. Размер комментария должен быть равен трём словам. Максимум одному предложению. Веди себя реалистично и позитивно.
    3. Дай экспертный комментарий от первого лица. Размер комментария должен быть равен шести словам. Веди себя реалистично и позитивно. Не делай оценочных суждений. Веди себя как эксперт в области наставничества и предпринимательства.
    '''
    full_req = question + prompt
    print('FULL REQ')
    print(full_req)
    payload = json.dumps({
        "messages": [
            {"content": "You are a helpful assistant.", "role": "system"},
            {"content": full_req, "role": "user"}
        ],
        "model": "deepseek-chat",
        "frequency_penalty": 0,
        "max_tokens": 2048,
        "presence_penalty": 0,
        "stop": None,
        "stream": False,
        "temperature": 1,
        "top_p": 1
    })

    headers = {
        'Content-Type': 'application/json',
        'Accept': 'application/json',
        'Authorization': f'Bearer {api_key}'
    }

    async with aiohttp.ClientSession() as session:
        async with session.post(url, headers=headers, data=payload) as response:
            resp = await response.json()
            resp_text = resp["choices"][0]["message"]["content"]
            form_text = await format_text(resp_text)
            print('COMMENT')
            print(form_text)
            return form_text


# req = '''
# ⏺️взяла билеты в Москву на выпускной по Личному Бренду к Насти Пикси
# ⏺️взяла офлайн проект а-ля Лена Летучая в Пскове на реализацию: буду ходить, как деловая колбаса и вручать народное признание от предпринимателей
# ⏺️готовлю 5 поток наставничества по Telegram - мои пупсики!!!! Это будет просто охуенооо 🤓
# ⏺️спикерю на форумах и конференциях с темами по Личному Бренду в Telegram и инфоцыганству в наставничестве. Одно выступление пришлось отменить, т к буду в Москве
# ⏺️учеба полным ходом, отстаю от плана, но руки не опускаю. Цель: сделать домашки по всем урокам и доп задания выполнить + дз применить на практике
# ⏺️ритуалы 92/ 100 (неужели я это скоро сделаю )
# ⏺️рилс 19/ 53 (продолжаю пилить тухлые рилсы, которые никто не смотрит, есть новые гипотезы на реализацию, но пока нет времени)
# ⏺️начинаем ремонт. Точка 😂
# ⏺️закончился абонемент в фитнес клуб - пока продлевать не буду, возобновляю утренние пробежки (лет 10 с перерывами бегаю в теплое время года)
# ⏺️продолжаю по-новому питаться и продолжаю портить блюда…. Бедная моя семья 🥴 (скинула 600 гр 😂)
# ⏺️вчера приехал из командировки любимый муж. 2 недели я была одна со своими спиногрызами ….  Ой, девочки, как же хорошо, когда дома любимый мужчина 🥰 … вообще, когда рядом любимый человек
#
# В кратце, моя жизнь сегодня. В сторьках, кстати, про ремонт рассказала, смотрите, пока не исчезли. Завтра выложу видос квартиры - 2шка хрущевка - это будет ДО
# '''
#response = get_req(req)
#print(response)