words_in_post = ['россия', 'украина', 'война', 'великая отечественная война', 'сша', 'ракет', 'ракета', 'ракеты',
                 'ветеран', '9 мая', 'инвалид', 'уголовное дело', 'сбил', 'убил', 'украине',
                 'изнасиловал', 'погиб', 'погибла', 'погибли', 'пострадал', 'пострадали',
                 'полиция', 'лгбт', 'мизулина', 'взрыв', 'суд', 'аллах', 'коран', 'умер', 'фсб', 'гру', 'мвд',
                 'зеленский', 'арестович', 'буданов', 'терроризм', 'террорист', 'фейки', 'фбк', 'навальный', 'экстремизм',
                 'авария', 'всу']
words_in_generated_message = ['виртуальный ассистент', 'виртуальный помощник', 'нейросеть', 'не могу', 'искусственный интеллект']